In [1]:
import mysql.connector as db
import pandas as pd

from IPython.display import display

## Query Select

In [10]:
connection = db.connect(
                         host="localhost",
                         database="dqlab_academy",
                         user="root",
                         password="MySQL"
                       )

query = "select * from ms_product"

dataset = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Close")

display(dataset)

MySQL Close

   no_urut kode_produk                         nama_produk   harga
0        1     prod-01                  Kotak Pensil DQLab   62500
1        2     prod-02               Flashdisk DQLab 64 GB   55000
2        3     prod-03            Gift Voucher DQLab 100rb  100000
3        4     prod-04               Flashdisk DQLab 32 GB   40000
4        5     prod-05            Gift Voucher DQLab 250rb  250000
5        6     prod-06  Pulpen Multifunction + Laser DQLab   92500
6        7     prod-07          Tas Travel Organizer DQLab   48000
7        8     prod-08               Gantungan Kunci DQLab   15800
8        9     prod-09           Buku Planner Agenda DQLab   92000
9       10     prod-10       Sticky Notes DQLab 500 sheets   55000

In [12]:
connection = db.connect(
                         host="localhost",
                         database="dqlab_academy",
                         user="root",
                         password="MySQL"
                       )
                      
query = "select nama_produk from ms_product"

nama_produk = pd.read_sql(query, connection)

if connection.is_connected():
  connection.close()
  print("MySQL is Close")

display(nama_produk)

MySQL is Close

                          nama_produk
0                  Kotak Pensil DQLab
1               Flashdisk DQLab 64 GB
2            Gift Voucher DQLab 100rb
3               Flashdisk DQLab 32 GB
4            Gift Voucher DQLab 250rb
5  Pulpen Multifunction + Laser DQLab
6          Tas Travel Organizer DQLab
7               Gantungan Kunci DQLab
8           Buku Planner Agenda DQLab
9       Sticky Notes DQLab 500 sheets

In [13]:
connection = db.connect(
                         host="localhost",
                         database="dqlab_academy",
                         user="root",
                         password="MySQL"
                       )
                      
query = "select nama_produk, harga from ms_product"

nama_produk = pd.read_sql(query, connection)

if connection.is_connected():
  connection.close()
  print("MySQL is Close")

display(nama_produk)

MySQL is Close

                          nama_produk   harga
0                  Kotak Pensil DQLab   62500
1               Flashdisk DQLab 64 GB   55000
2            Gift Voucher DQLab 100rb  100000
3               Flashdisk DQLab 32 GB   40000
4            Gift Voucher DQLab 250rb  250000
5  Pulpen Multifunction + Laser DQLab   92500
6          Tas Travel Organizer DQLab   48000
7               Gantungan Kunci DQLab   15800
8           Buku Planner Agenda DQLab   92000
9       Sticky Notes DQLab 500 sheets   55000

In [14]:
connection = db.connect(
                         host="localhost",
                         database="dqlab_academy",
                         user="root",
                         password="MySQL"
                       )
                      
query = "select nama_produk, harga from ms_product LIMIT 5"

nama_produk = pd.read_sql(query, connection)

if connection.is_connected():
  connection.close()
  print("MySQL is Close")

display(nama_produk)

MySQL is Close

                nama_produk   harga
0        Kotak Pensil DQLab   62500
1     Flashdisk DQLab 64 GB   55000
2  Gift Voucher DQLab 100rb  100000
3     Flashdisk DQLab 32 GB   40000
4  Gift Voucher DQLab 250rb  250000

## Select Distinct -> Menghilangkan Duplikasi Data

In [16]:
connection = db.connect(
                         host="localhost",
                         database="dqlab_academy",
                         user="root",
                         password="MySQL"
                       )
                      
query = "select distinct nama_customer, alamat from ms_pelanggan"

nama_produk = pd.read_sql(query, connection)

if connection.is_connected():
  connection.close()
  print("MySQL is Close")

display(nama_produk)

MySQL is Close

         nama_customer                                    alamat
0    Eva Noviati, S.H.            Vila Sempilan, No. 67 - Kota B
1            Heidi Goh            Vila Sempilan, No. 11 - Kota B
2        Unang Handoko             Vila Sempilan, No. 1 - Kota B
3    Jokolono Sukarman    Vila Permata Intan Berkilau, Blok C5-7
4         Tommy Sinaga    Vila Permata Intan Berkilau, Blok A1/2
5       Irwan Setianto        Vila Gunung Seribu, Blok 01 - No.1
6         Agus Cahyono       Vila Gunung Seribu, Blok f4 - No. 8
7         Maria Sirait  Vila Bukit Sagitarius, Gang. Sawit No. 3
8      Ir. Ita Nugraha  Vila Bukit Sagitarius, Gang Kelapa No. 6
9  Djoko Wardoyo, Drs.      Vila Bukit Sagitarius, Blok A1 No. 1

## Penggunaan Prefix

In [18]:
connection = db.connect(
                         host="localhost",
                         database="dqlab_academy",
                         user="root",
                         password="MySQL"
                       )
                      
query = "select ms_product.kode_produk from ms_product"

nama_produk = pd.read_sql(query, connection)

if connection.is_connected():
  connection.close()
  print("MySQL is Close")

display(nama_produk)

MySQL is Close

  kode_produk
0     prod-01
1     prod-02
2     prod-03
3     prod-04
4     prod-05
5     prod-06
6     prod-07
7     prod-08
8     prod-09
9     prod-10

## Penggunaan Alias

In [20]:
connection = db.connect(
                         host="localhost",
                         database="dqlab_academy",
                         user="root",
                         password="MySQL"
                       )
                      
query = "select no_urut nomor, nama_produk nama from ms_product"

nama_produk = pd.read_sql(query, connection)

if connection.is_connected():
  connection.close()
  print("MySQL is Close")

display(nama_produk)

MySQL is Close

   nomor                                nama
0      1                  Kotak Pensil DQLab
1      2               Flashdisk DQLab 64 GB
2      3            Gift Voucher DQLab 100rb
3      4               Flashdisk DQLab 32 GB
4      5            Gift Voucher DQLab 250rb
5      6  Pulpen Multifunction + Laser DQLab
6      7          Tas Travel Organizer DQLab
7      8               Gantungan Kunci DQLab
8      9           Buku Planner Agenda DQLab
9     10       Sticky Notes DQLab 500 sheets

In [21]:
connection = db.connect(
                         host="localhost",
                         database="dqlab_academy",
                         user="root",
                         password="MySQL"
                       )
                      
query = "select no_urut nomor, nama_produk nama from ms_product"

nama_produk = pd.read_sql(query, connection)

if connection.is_connected():
  connection.close()
  print("MySQL is Close")

display(nama_produk)

MySQL is Close

   nomor                                nama
0      1                  Kotak Pensil DQLab
1      2               Flashdisk DQLab 64 GB
2      3            Gift Voucher DQLab 100rb
3      4               Flashdisk DQLab 32 GB
4      5            Gift Voucher DQLab 250rb
5      6  Pulpen Multifunction + Laser DQLab
6      7          Tas Travel Organizer DQLab
7      8               Gantungan Kunci DQLab
8      9           Buku Planner Agenda DQLab
9     10       Sticky Notes DQLab 500 sheets

In [23]:
connection = db.connect(
                         host="localhost",
                         database="dqlab_academy",
                         user="root",
                         password="MySQL"
                       )
                      
query = "select ms_product.harga harga_jual from ms_product"

nama_produk = pd.read_sql(query, connection)

if connection.is_connected():
  connection.close()
  print("MySQL is Close")

display(nama_produk)

MySQL is Close

   harga_jual
0       62500
1       55000
2      100000
3       40000
4      250000
5       92500
6       48000
7       15800
8       92000
9       55000

In [25]:
connection = db.connect(
                         host="localhost",
                         database="dqlab_academy",
                         user="root",
                         password="MySQL"
                       )
                      
query = "select * from ms_product t2"

nama_produk = pd.read_sql(query, connection)

if connection.is_connected():
  connection.close()
  print("MySQL is Close")

display(nama_produk)

MySQL is Close

   no_urut kode_produk                         nama_produk   harga
0        1     prod-01                  Kotak Pensil DQLab   62500
1        2     prod-02               Flashdisk DQLab 64 GB   55000
2        3     prod-03            Gift Voucher DQLab 100rb  100000
3        4     prod-04               Flashdisk DQLab 32 GB   40000
4        5     prod-05            Gift Voucher DQLab 250rb  250000
5        6     prod-06  Pulpen Multifunction + Laser DQLab   92500
6        7     prod-07          Tas Travel Organizer DQLab   48000
7        8     prod-08               Gantungan Kunci DQLab   15800
8        9     prod-09           Buku Planner Agenda DQLab   92000
9       10     prod-10       Sticky Notes DQLab 500 sheets   55000

In [27]:
connection = db.connect(
                         host="localhost",
                         database="dqlab_academy",
                         user="root",
                         password="MySQL"
                       )
                      
query = "select t2.nama_produk, t2.harga from ms_product t2"

nama_produk = pd.read_sql(query, connection)

if connection.is_connected():
  connection.close()
  print("MySQL is Close")

display(nama_produk)

MySQL is Close

                          nama_produk   harga
0                  Kotak Pensil DQLab   62500
1               Flashdisk DQLab 64 GB   55000
2            Gift Voucher DQLab 100rb  100000
3               Flashdisk DQLab 32 GB   40000
4            Gift Voucher DQLab 250rb  250000
5  Pulpen Multifunction + Laser DQLab   92500
6          Tas Travel Organizer DQLab   48000
7               Gantungan Kunci DQLab   15800
8           Buku Planner Agenda DQLab   92000
9       Sticky Notes DQLab 500 sheets   55000

## Penggunaan Where

In [31]:
connection = db.connect(
                         host="localhost",
                         database="dqlab_academy",
                         user="root",
                         password="MySQL"
                       )
                      
query = "select * from ms_product where nama_produk = 'Tas Travel Organizer DQLab'"

nama_produk = pd.read_sql(query, connection)

if connection.is_connected():
  connection.close()
  print("MySQL is Close")

display(nama_produk)

MySQL is Close

   no_urut kode_produk                 nama_produk  harga
0        7     prod-07  Tas Travel Organizer DQLab  48000

In [33]:
connection = db.connect(
                         host="localhost",
                         database="dqlab_academy",
                         user="root",
                         password="MySQL"
                       )
                      
query = "select * from ms_product where nama_produk = 'Gantungan Kunci DQLab' or nama_produk = 'Tas Travel Organizer DQLab' or nama_produk = 'Flashdisk DQLab 64 GB'"

nama_produk = pd.read_sql(query, connection)

if connection.is_connected():
  connection.close()
  print("MySQL is Close")

display(nama_produk)

MySQL is Close

   no_urut kode_produk                 nama_produk  harga
0        2     prod-02       Flashdisk DQLab 64 GB  55000
1        7     prod-07  Tas Travel Organizer DQLab  48000
2        8     prod-08       Gantungan Kunci DQLab  15800

In [35]:
connection = db.connect(
                         host="localhost",
                         database="dqlab_academy",
                         user="root",
                         password="MySQL"
                       )
                      
query = "select * from ms_product where harga > 5000"

nama_produk = pd.read_sql(query, connection)

if connection.is_connected():
  connection.close()
  print("MySQL is Close")

display(nama_produk)

MySQL is Close

   no_urut kode_produk                         nama_produk   harga
0        1     prod-01                  Kotak Pensil DQLab   62500
1        2     prod-02               Flashdisk DQLab 64 GB   55000
2        3     prod-03            Gift Voucher DQLab 100rb  100000
3        4     prod-04               Flashdisk DQLab 32 GB   40000
4        5     prod-05            Gift Voucher DQLab 250rb  250000
5        6     prod-06  Pulpen Multifunction + Laser DQLab   92500
6        7     prod-07          Tas Travel Organizer DQLab   48000
7        8     prod-08               Gantungan Kunci DQLab   15800
8        9     prod-09           Buku Planner Agenda DQLab   92000
9       10     prod-10       Sticky Notes DQLab 500 sheets   55000

In [38]:
connection = db.connect(
                         host="localhost",
                         database="dqlab_academy",
                         user="root",
                         password="MySQL"
                       )
                      
query = "select * from ms_product where nama_produk = 'Gantungan Kunci DQLab' and harga < 50000"

nama_produk = pd.read_sql(query, connection)

if connection.is_connected():
  connection.close()
  print("MySQL is Close")

display(nama_produk)

MySQL is Close

   no_urut kode_produk            nama_produk  harga
0        8     prod-08  Gantungan Kunci DQLab  15800

In [40]:
connection = db.connect(
                         host="localhost",
                         database="dqlab_academy",
                         user="root",
                         password="MySQL"
                       )
                      
query = "select kode_pelanggan, nama_produk, qty, harga, qty*harga total_harga from tr_penjualan where qty*harga >= 10000 order by total_harga desc"

nama_produk = pd.read_sql(query, connection)

if connection.is_connected():
  connection.close()
  print("MySQL is Close")

display(nama_produk)

MySQL is Close

   kode_pelanggan                    nama_produk  qty   harga  total_harga
0     dqlabcust02       Gift Voucher DQLab 250rb    4  250000      1000000
1     dqlabcust07             Kotak Pensil DQLab    5   62500       312500
2     dqlabcust07      Buku Planner Agenda DQLab    3   92000       276000
3     dqlabcust05      Buku Planner Agenda DQLab    3   92000       276000
4     dqlabcust03  Sticky Notes DQLab 500 sheets    5   55000       275000
5     dqlabcust01  Sticky Notes DQLab 500 sheets    4   55000       220000
6     dqlabcust01       Gift Voucher DQLab 100rb    2  100000       200000
7     dqlabcust03          Flashdisk DQLab 32 GB    4   40000       160000
8     dqlabcust07          Flashdisk DQLab 32 GB    3   40000       120000
9     dqlabcust03          Flashdisk DQLab 64 GB    2   55000       110000
10    dqlabcust07         Flash disk DQLab 32 GB    1  100000       100000
11    dqlabcust05          Flashdisk DQLab 32 GB    2   40000        80000
12    dqlabcust05             Kotak Pensil DQLab    1   62500        62500
13    dqlabcust01     Tas Travel Organizer DQLab    1   48000        48000
14    dqlabcust02          Gantungan Kunci DQLab    2   15800        31600